package RealProblems.MeiTuan2022_8_20;

/**
 * Author:
 * Created at:2022/8/20
 * Updated at:
 *
 *
 *美团2022.8.20秋招笔试题
 *
 *
 *
 *小团的玩具火箭有点磨损了，上面有很多地方翘起来了，小团想要用强力胶进行修补，但在强力胶凝结之前，
 * 需要找点东西压住。幸好小团有很多这样的东西。小团有m种配重材料，
 * 第i种材料重ai单位重量（因为小团有太多了，可以认为每种都有任意多个）。
 * 火箭上有n个地方翘起来了，需要至少bi单位重量的东西来压住，
 * 而且只能用一个配重材料来压，(多了的话不好压，多个配重材料容易散开，所以小团不想用多个来折腾)。
 * 小团想一次就把所有翘起来的地方全都修补好，请问他需要使用的配重材料重量之和最少是多少？
 *
 *
 * 第一行两个正整数n和m，分别代表需要修补的地方个数以及材料种类数。
 *
 * 接下来一行n个数b1,b2,...,bn，含义如题。
 *
 * 接下来一行m个数 a1,a2,...,am，含义如题。
 *
 * 对于40%的数据，n,m≤100
 *
 * 对于另外30%的数据，n,m≤2000
 *
 * 对于所有数据，1≤n,m≤50000，1≤ai,bi≤104
 *
 *
 * 输出小团最少需要使用的配重材料重量之和。如果没有任何办法满足，输出-1
 *
 * 1 1
 * 5
 * 4
 *
 *
 * -1
 *
 *
 * 提示
 * 样例1解释
 *
 * 需要5单位重量，只有4单位重量的材料，压不住，输出-1。
 *
 *
 *
 * 输入样例2
 *
 * 3 3
 *
 * 4 1 3
 *
 * 4 2 1
 *
 *
 *
 * 输出样例2
 *
 * 9
 *
 *
 *
 * 样例解释2
 *
 * 第一个地方需要重量为4的，第二个地方可以用重量为1的，第三个地方只能选择重量为4的才能压住。所以总重量需求为9。可以证明没有更优方案。
 *
 *
 **/
public class Solution5 {

    /**
     *
     */





}
